# 1차시

In [1]:
import pandas as pd

In [29]:
week1 = pd.read_csv("data/sales(1).csv")
week2 = pd.read_csv("data/sales(2).csv")
customers = pd.read_csv("data/customer.csv")
foods = pd.read_csv("data/food.csv")
satisfaction = pd.read_csv("data/satisfaction.csv")

In [5]:
week1

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

In [6]:
week2

     Customer ID  Food ID
0            688       10
1            813        7
2            495       10
3            189        5
4            267        3
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[250 rows x 2 columns]

In [7]:
customers

,ID,First Name,Last Name,Gender,Company,Occupation
0,1,Joseph,Perkins,Male,Dynazzy,Community Outreach Specialist
1,2,Jennifer,Alvarez,Female,DabZ,Senior Quality Engineer
2,3,Roger,Black,Male,Tagfeed,Account Executive
3,4,Steven,Evans,Male,Fatz,Registered Nurse
4,5,Judy,Morrison,Female,Demivee,Legal Assistant
...,...,...,...,...,...,...
995,996,Debra,Garcia,Female,Dazzlesphere,Structural Engineer
996,997,Douglas,Bishop,Male,Livepath,Developer I
997,998,Frank,Franklin,Male,Brainverse,Nurse Practicioner
998,999,Jessica,Burns,Female,Babbleblab,Financial Advisor
999,1000,Brian,Daniels,Male,Tazzy,Physical Therapy Assistant

In [8]:
foods

    First Name  Gender          City Frequency       Item  Spend
0        Wanda  Female      Stamford    Weekly     Burger  15.66
1         Eric    Male      Stamford     Daily    Chalupa  10.56
2      Charles    Male      New York     Never      Sushi  42.14
3         Anna  Female  Philadelphia      Once  Ice Cream  11.01
4      Deborah  Female  Philadelphia     Daily    Chalupa  23.49
..         ...     ...           ...       ...        ...    ...
995      Donna  Female      New York   Monthly      Sushi  83.53
996     Albert    Male  Philadelphia     Daily      Sushi  72.88
997       Jean  Female      Stamford    Weekly      Donut   5.85
998    Jessica  Female      New York     Daily    Chalupa  43.19
999      Brian    Male      New York     Daily    Chalupa  28.36

[1000 rows x 6 columns]

In [9]:
satisfaction

     Satisfaction Rating
0                      2
1                      7
2                      3
3                      7
4                     10
..                   ...
245                    1
246                    2
247                    8
248                   10
249                    3

[250 rows x 1 columns]

In [11]:
pd.concat(objs = [week1,week2]).loc[0]
# concat() : 데이터프레임을 상,하로 결합 (인덱스는 그대로 연결)

   Customer ID  Food ID
0          537        9
0          688       10

In [13]:
pd.concat(objs = [week1,week2], axis=1)
# concat(axis=1) : 데이터프레임을 좌, 우로 결합 (인덱스 순서대로 결합)

     Customer ID  Food ID  Customer ID  Food ID
0            537        9          688       10
1             97        4          813        7
2            658        1          495       10
3            202        2          189        5
4            155        9          267        3
..           ...      ...          ...      ...
245          413        9          783       10
246          926        6          556       10
247          134        3          547        9
248          396        6          252        9
249          535       10          249        6

[250 rows x 4 columns]

In [14]:
week3 = week2.sort_index(ascending=False)
week3

     Customer ID  Food ID
249          249        6
248          252        9
247          547        9
246          556       10
245          783       10
..           ...      ...
4            267        3
3            189        5
2            495       10
1            813        7
0            688       10

[250 rows x 2 columns]

In [16]:
pd.concat(objs = [week1,week3], axis=1)
#인덱스와 일치하는데로 연결

     Customer ID  Food ID  Customer ID  Food ID
0            537        9          688       10
1             97        4          813        7
2            658        1          495       10
3            202        2          189        5
4            155        9          267        3
..           ...      ...          ...      ...
245          413        9          783       10
246          926        6          556       10
247          134        3          547        9
248          396        6          252        9
249          535       10          249        6

[250 rows x 4 columns]

In [18]:
sales = pd.concat(objs = [week1,week2], keys=['Week1','Week2'])
#keys=파라미터 : 각 데이터 프레임의 명칭 지정 (멀티 인덱스로 활용)
sales

           Customer ID  Food ID
Week1 0            537        9
      1             97        4
      2            658        1
      3            202        2
      4            155        9
...                ...      ...
Week2 245          783       10
      246          556       10
      247          547        9
      248          252        9
      249          249        6

[500 rows x 2 columns]

In [20]:
week1.merge(week2,on = 'Customer ID',how='inner')

    Customer ID  Food ID_x  Food ID_y
0           537          9          5
1           155          9          3
2           155          1          3
3           503          5          8
4           503          5          9
..          ...        ...        ...
57          945          5          4
58          343          3          5
59          343          3          2
60          343          3          7
61          621          9          6

[62 rows x 3 columns]

In [21]:
week1.merge(week2,on = 'Customer ID',how='inner', suffixes=['- Week1','- Week2'])
# suffixes=파라미터 : 뒤에 자동으로 붙여질 멘트 지정 가능

    Customer ID  Food ID- Week1  Food ID- Week2
0           537               9               5
1           155               9               3
2           155               1               3
3           503               5               8
4           503               5               9
..          ...             ...             ...
57          945               5               4
58          343               3               5
59          343               3               2
60          343               3               7
61          621               9               6

[62 rows x 3 columns]

In [22]:
week1.merge(week2, on =['Customer ID','Food ID'],how='inner')
# Customer ID와 Food ID가 교집합을 이루는 데이터만 결합

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [24]:
week1.merge(week2,on = 'Customer ID',how='outer', suffixes=['- Week1','- Week2'])

     Customer ID  Food ID- Week1  Food ID- Week2
0            537             9.0             5.0
1             97             4.0             NaN
2            658             1.0             NaN
3            202             2.0             NaN
4            155             9.0             3.0
..           ...             ...             ...
449          855             NaN             4.0
450          559             NaN            10.0
451          276             NaN             4.0
452          556             NaN            10.0
453          252             NaN             9.0

[454 rows x 3 columns]

In [25]:
week1.merge(week2,on = 'Customer ID',how='outer', suffixes=['- Week1','- Week2'], indicator=True)
#indicator=True 파라미터 : 해당 데이터가 어느 데이터프레임에서 온 것인지 추가로 표시

     Customer ID  Food ID- Week1  Food ID- Week2      _merge
0            537             9.0             5.0        both
1             97             4.0             NaN   left_only
2            658             1.0             NaN   left_only
3            202             2.0             NaN   left_only
4            155             9.0             3.0        both
..           ...             ...             ...         ...
449          855             NaN             4.0  right_only
450          559             NaN            10.0  right_only
451          276             NaN             4.0  right_only
452          556             NaN            10.0  right_only
453          252             NaN             9.0  right_only

[454 rows x 4 columns]

In [33]:
week1.merge(foods, on='Food ID', how='left')
# Food ID가 같은 행의 왼쪽에 나머지 데이터를 결합

     Customer ID  Food ID   Food Item  Price
0            537        9       Donut   0.99
1             97        4  Quesadilla   4.25
2            658        1       Sushi   3.99
3            202        2     Burrito   9.99
4            155        9       Donut   0.99
..           ...      ...         ...    ...
245          413        9       Donut   0.99
246          926        6       Pasta  13.99
247          134        3        Taco   2.99
248          396        6       Pasta  13.99
249          535       10       Drink   1.75

[250 rows x 4 columns]

In [34]:
week1.merge(foods, on='Food ID', how='right')
#우측을 기준으로 결합

     Customer ID  Food ID Food Item  Price
0            658        1     Sushi   3.99
1            600        1     Sushi   3.99
2            155        1     Sushi   3.99
3            341        1     Sushi   3.99
4             20        1     Sushi   3.99
..           ...      ...       ...    ...
245          809       10     Drink   1.75
246          584       10     Drink   1.75
247          274       10     Drink   1.75
248          151       10     Drink   1.75
249          535       10     Drink   1.75

[250 rows x 4 columns]

In [35]:
foods

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49
5        6       Pasta  13.99
6        7       Steak  24.99
7        8       Salad  11.25
8        9       Donut   0.99
9       10       Drink   1.75

In [36]:
week1.merge(foods, how='left', on='Food ID', sort = True)
#Food ID 열을 기준으로 정렬

     Customer ID  Food ID Food Item  Price
0            658        1     Sushi   3.99
1            600        1     Sushi   3.99
2            155        1     Sushi   3.99
3            341        1     Sushi   3.99
4             20        1     Sushi   3.99
..           ...      ...       ...    ...
245          809       10     Drink   1.75
246          584       10     Drink   1.75
247          274       10     Drink   1.75
248          151       10     Drink   1.75
249          535       10     Drink   1.75

[250 rows x 4 columns]

In [38]:
week2.merge(customers,how='left', left_on ='Customer ID',right_on='ID')
# 결합하기 위해 공통적으로 가지고 있는 열이 없을 경우
# left_on, right_on 파라미터 : 결합하고자 하는 열을 각각 다르게 지정해준다.

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,688,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,813,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,495,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,189,Roger,Gordon,Male,Skilith,Operator
4,267,3,267,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...,...
245,783,10,783,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,556,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,547,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,252,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,249,Anthony,Carpenter,Male,Shuffletag,Health Coach I

In [39]:
week1.merge(customers, how='left', left_on='Customer ID',right_index=True)
# left_on, right_index : 좌측은 인덱스 이름을 기준으로, 오른쪽은 인덱스를 기준으로 결합

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,538.0,Sara,Washington,Female,Skimia,Database Administrator III
1,97,4,98.0,Jean,Mills,Female,Fivebridge,Product Engineer
2,658,1,659.0,Howard,Hudson,Male,Topicshots,Professor
3,202,2,203.0,Annie,Lane,Female,Skyble,Marketing Manager
4,155,9,156.0,Stephanie,Kelly,Female,Youopia,Automation Specialist III
...,...,...,...,...,...,...,...,...
245,413,9,414.0,Harold,Adams,Male,Dazzlesphere,Account Coordinator
246,926,6,927.0,Nicholas,Morris,Male,Linkbridge,Assistant Professor
247,134,3,135.0,Richard,Murphy,Male,Cogidoo,Software Consultant
248,396,6,397.0,Brenda,Ryan,Female,Oozz,Nurse Practicioner
249,535,10,536.0,Sara,Dean,Female,Skidoo,Recruiter

In [41]:
customers.loc[202]

ID                          203
First Name                Annie
Last Name                  Lane
Gender                   Female
Company                  Skyble
Occupation    Marketing Manager
Name: 202, dtype: object

In [43]:
week1.join(satisfaction)

     Customer ID  Food ID  Satisfaction Rating
0            537        9                    2
1             97        4                    7
2            658        1                    3
3            202        2                    7
4            155        9                   10
..           ...      ...                  ...
245          413        9                    1
246          926        6                    2
247          134        3                    8
248          396        6                   10
249          535       10                    3

[250 rows x 3 columns]

In [ ]:
week1.merge(satisfaction, how='left',left_index=True, right_index=True)